app/Controllers/Frontend/AuthenticationController.php

            'location' => $locationData['location'],
        ];

        $userModel->insert($data);
---
INSERT INTO `users` (`name`, `email`, `password`, `ip_address`, `device`, `browser`, `device_type`, `location`, `created_at`, `updated_at`) VALUES ('iowjk', 'iodsjklm@gmail.com', '$2y$10$YIK08MD.JIZo8NXSu1/Rl.l2iLY1yLI7lHvtt5Y.tO37tCBytA7Du', '::1', 'Windows 10', 'Chrome', 'Desktop', 'Localhost', '2025-03-10 05:10:01', '2025-03-10 05:10:01')